# SheetOrganizationId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IViewSheetSet..::..SheetOrganizationId Property
IViewSheetSet Interface See Also
---
ElementId to the BrowserOrganization for sheets.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
ElementId SheetOrganizationId { get; set; }
```

Visual Basic
---
```text
Property SheetOrganizationId As ElementId
	Get
	Set
```

Visual C++
---
```text
property ElementId^ SheetOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible. |

# See Also
IViewSheetSet Interface
Autodesk.Revit.DB Namespace